tap "gromgit/brewtils"
tap "libsql/sqld"
tap "localstack/tap"
tap "tursodatabase/tap"
brew "libffi"
brew "zlib"
brew "openssl@3"
brew "awscli"
brew "bat"
brew "gcc"
brew "btop"
brew "chafa"
brew "csvlens"
brew "direnv"
brew "distrobox"
brew "docker"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "gitui"
brew "glow"
brew "just"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "lazyssh"
brew "libpq"
brew "libyaml"
brew "multitail"
brew "neovim"
brew "ollama"
brew "ripgrep"
brew "opencode"
brew "pgcli"
brew "poppler"
brew "postgresql-hll"
brew "postgresql@18", restart_service: :changed, link: true
brew "python-yq"
brew "r"
brew "rainfrog"
brew "scrcpy"
brew "starship"
brew "television"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "trivy"
brew "watchman"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "gromgit/brewtils/taproom"
brew "localstack/tap/localstack-cli"
brew "tursodatabase/tap/turso"
cask "font-symbols-only-nerd-font"
vscode "aamer.json-to-nestjs-dto"
vscode "alarm.pkl-viewer"
vscode "amazonwebservices.amazon-q-vscode"
vscode "aquasecurityofficial.trivy-vulnerability-scanner"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.flutter"
vscode "donebd.rest-client-api"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "haseeb-raza.terminal-faah"
vscode "lakefs.lakefs-dvc"
vscode "marimo-team.vscode-marimo"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.vscode-typescript-next"
vscode "sclu1034.justfile"
vscode "skellock.just"
